app/views/albums/new.html.haml

      Location
      - if params[:venue].present?
---
SELECT `venues`.* FROM `venues`