app/controllers/albums_controller.rb

  def index
    @album = @user.album
    unless @album.blank?
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 4 LIMIT 1

  def new
    @locations = Venue.all.collect(&:name).uniq
---
SELECT `venues`.* FROM `venues`

  def create
    params['album']['user_id'] = @user.id
    @album = Album.new(params[:album])
    if @album.save
      venue = Venue.where(:name => params[:album][:location]).first
      @album.images.update_all(venue_id: venue.id)
      redirect_to albums_path
    else
      @locations = Venue.all.collect(&:name).uniq
---
INSERT INTO `albums` (`created_at`, `updated_at`, `user_id`) VALUES ('2013-12-02 11:31:22', '2013-12-02 11:31:22', 5)
SELECT `venues`.* FROM `venues` WHERE `venues`.`name` = 'Avenue Road' LIMIT 1
UPDATE `images` SET `photo_updated_at` = '2013-12-02 11:31:42', `created_at` = '2013-12-02 11:31:44', `updated_at` = '2013-12-02 11:31:44', `venue_id` = 8 WHERE `images`.`id` = 24
SELECT `venues`.* FROM `venues`

  def edit
    @album = Album.find(params[:id])
    @locations = Venue.all.collect(&:name).uniq
    @venue = Venue.find(@album.images.first.venue_id)
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 10 LIMIT 1
SELECT `venues`.* FROM `venues`
SELECT `images`.* FROM `images` WHERE `images`.`album_id` = 11 LIMIT 1
SELECT `venues`.* FROM `venues` WHERE `venues`.`id` = 8 LIMIT 1

  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(params[:album])
      venue = Venue.where(:name => params[:album][:location]).first
      @album.images.update_all(venue_id: venue.id)
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 10 LIMIT 1
SELECT `venues`.* FROM `venues` WHERE `venues`.`name` = 'Avenue Road' LIMIT 1
UPDATE `images` SET `photo_file_name` = 'Syed-1385984965.png', `photo_content_type` = 'image/png', `photo_file_size` = 538308, `photo_updated_at` = '2013-12-02 11:49:23', `updated_at` = '2013-12-02 11:49:25' WHERE `images`.`id` = 31