app/controllers/profiles_controller.rb

  def create
    @profile = @user.build_profile(params[:profile])
    if @profile.save
---
INSERT INTO `profiles` (`age`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `city`, `created_at`, `dob`, `first_name`, `gender`, `last_name`, `updated_at`, `user_id`) VALUES (NULL, 'image/jpeg', 'Wealthy_Thai_restaurant_-_1.jpg', 65856, '2013-12-02 07:19:56', 'Bangalore', '2013-12-02 07:19:56', '2011-12-12', 'Syed', 'M', 'Tabrez', '2013-12-02 07:19:56', 5)
UPDATE `profiles` SET `age` = 1, `updated_at` = '2013-12-02 07:19:56' WHERE `profiles`.`id` = 5

  def update
    @profile = @user.profile
    if @profile.update_attributes(params[:profile])
---
UPDATE `profiles` SET `avatar_file_name` = 'solar.jpg', `avatar_file_size` = 407042, `avatar_updated_at` = '2013-12-02 12:04:00', `updated_at` = '2013-12-02 12:04:03' WHERE `profiles`.`id` = 5