app/controllers/venues_controller.rb

  def index
    @venues = Venue.all
---
SELECT `venues`.* FROM `venues`

  def create
    @venue = Venue.new(params[:venue])
    if @venue.save
      if params['redirect'].present?
         @locations = Venue.all.collect(&:name).uniq
---
INSERT INTO `venues` (`city`, `country`, `created_at`, `name`, `state`, `updated_at`) VALUES ('London', 'UK', '2013-12-02 06:47:34', 'Venue A', '', '2013-12-02 06:47:34')
SELECT `venues`.* FROM `venues`